swak4Foam/Examples/RegionSolvers/thingOnAStick/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    top
    {
        type            noSlip;
        //       type            movingWallVelocity;
         //         type            fixedValue;
        value           uniform (0 0 0);
    }

    obstacle
    {
        type noSlip;
        //      type            movingWallVelocity;
      //         type            fixedValue;
      value uniform (0 0 0);
    }

    frontAndBack {
        type empty;
    }

    inlet
    {
        type            fixedValue;
        value           uniform (0.5 0 0);
    }

   mitte
    {
        type            symmetryPlane;
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        //        type            zeroGradient;
        value uniform (0 0 0);
    }
}

// ************************************************************************* //
