swak4Foam/Examples/RegionSolvers/thingOnAStick/0.org/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class        pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    top
    {
        type            fixedValue;
        // Field Value
        value           uniform (0 0 0);
    }

    obstacle
    {
        type            groovyBC;
        // Field Value
        value           uniform (0 0 0);
        valueExpression "toPoint(mapped(D))";
        // debugCommonDriver 1;
        // traceScanning 1;
        // traceParsing 1;
    }

    inlet
    {
        type            fixedValue;
        // type zeroGradient;
        // Field Value
        value           uniform (0 0 0);
    }

    outlet
    {
        type            fixedValue;
        // type zeroGradient;
        // Field Value
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
    mitte
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
